[![AnalyticsDojo](https://github.com/rpi-techfundamentals/spring2019-materials/blob/master/fig/final-logo.png?raw=1)](http://rpi.analyticsdojo.com)
<center><h1>Introduction to Python - Introduction to Apply Function</h1></center>
<center><h3><a href = 'http://rpi.analyticsdojo.com'>rpi.analyticsdojo.com</a></h3></center>

# Introduction to Apply Function
- Don't loop over a dataframe. 
- Instead, us the apply function to process a function across each value.

In [1]:
import pandas as pd
df=pd.read_csv('https://raw.githubusercontent.com/rpi-techfundamentals/spring2019-materials/master/input/train.csv')
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

### Make it easy with the lambda function.
- Create a value for `Age-squared`.

In [2]:
df['age-squared']=df['Age'].apply(lambda x: x**2)

### Or define an entire function.
- Define a function to get the title from the name. 
- Always test your function with a single entry, not the apply.

In [8]:
def get_title(x):
  
  x = str(x)
  x = x.split(',') #Split at the comma
  x = x[1].strip() #remove any leading spaces
  x = x.split(' ')#Split at the spaces
  return x[0]

#Always test your function with a single entry, not the apply.
get_title('Dooley, Mr. Patrick')

'Mr.'

In [12]:
df['Title']=df['Name'].apply(get_title)
df[['Name','Title']]

                                                  Name  Title
0                              Braund, Mr. Owen Harris    Mr.
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   Mrs.
2                               Heikkinen, Miss. Laina  Miss.
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   Mrs.
4                             Allen, Mr. William Henry    Mr.
..                                                 ...    ...
886                              Montvila, Rev. Juozas   Rev.
887                       Graham, Miss. Margaret Edith  Miss.
888           Johnston, Miss. Catherine Helen "Carrie"  Miss.
889                              Behr, Mr. Karl Howell    Mr.
890                                Dooley, Mr. Patrick    Mr.

[891 rows x 2 columns]

In [13]:
df['Title'].unique()

array(['Mr.', 'Mrs.', 'Miss.', 'Master.', 'Don.', 'Rev.', 'Dr.', 'Mme.',
       'Ms.', 'Major.', 'Lady.', 'Sir.', 'Mlle.', 'Col.', 'Capt.', 'the',
       'Jonkheer.'], dtype=object)

In [14]:
df['Title'].value_counts()

Mr.          517
Miss.        182
Mrs.         125
Master.       40
Dr.            7
Rev.           6
Major.         2
Col.           2
Mlle.          2
Lady.          1
Capt.          1
Jonkheer.      1
Don.           1
Ms.            1
the            1
Mme.           1
Sir.           1
Name: Title, dtype: int64

### Pass Additional Values
You can even use things that pass additional values.

In [19]:
RECODE_MRS=['Lady.','Mme.']
RECODE_MISS=['Ms.']
RECODE_MR=['Sir.','the','Don.','Jonkheer.','Capt.']
def get_title2(x,recode_mrs, recode_miss, recode_mr):
  
  x = str(x)
  x = x.split(',') #Split at the comma
  x = x[1].strip() #remove any leading spaces
  x = x.split(' ')#Split at the spaces
  x = x[0] #select the first word. 
  if x in recode_mrs:
    x='Mrs.'
  elif x in recode_miss:
    x='Miss.'
  elif x in recode_mr:
    x='Mr.'
  return x

#Always test your function with a single entry, not the apply.
get_title('Dooley, Sir., Patrick', recode_mrs=RECODE_MRS, recode_miss=RECODE_MISS, recode_mr=RECODE_MR)

'Mr.'

In [20]:
df['Title']=df['Name'].apply(get_title2,recode_mrs=RECODE_MRS, recode_miss=RECODE_MISS, recode_mr=RECODE_MR )
df[['Name','Title']]

                                                  Name  Title
0                              Braund, Mr. Owen Harris    Mr.
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   Mrs.
2                               Heikkinen, Miss. Laina  Miss.
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   Mrs.
4                             Allen, Mr. William Henry    Mr.
..                                                 ...    ...
886                              Montvila, Rev. Juozas   Rev.
887                       Graham, Miss. Margaret Edith  Miss.
888           Johnston, Miss. Catherine Helen "Carrie"  Miss.
889                              Behr, Mr. Karl Howell    Mr.
890                                Dooley, Mr. Patrick    Mr.

[891 rows x 2 columns]

In [21]:
df['Title'].value_counts()

Mr.        521
Miss.      183
Mrs.       127
Master.     40
Dr.          7
Rev.         6
Mlle.        2
Major.       2
Col.         2
Capt.        1
Name: Title, dtype: int64

### Using Values from more than one column
- Apply somethign on the entire dataframe if calcs involve more than once column.

In [24]:
def complex_process(row):
  
  return row['Sex']+str(row['Age'])

df.apply(complex_process, axis = 1)

0        male22.0
1      female38.0
2      female26.0
3      female35.0
4        male35.0
          ...
886      male27.0
887    female19.0
888     femalenan
889      male26.0
890      male32.0
Length: 891, dtype: object